Revit 2027 API
CurveByPointsArrayIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveByPointsArrayIterator()
Public Sub New
public:
CurveByPointsArrayIterator()
new : unit -> CurveByPointsArrayIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
CurveByPointsArrayIterator Class
Autodesk.Revit.DB Namespace